# 6. Преобразование данных
# Преобразуйте JSON-объект, содержащий список температур за месяц, в словарь, 
# где ключами будут даты, а значениями — температуры.

import json

json_data = {
    "Температуры за месяц": [
        {"Дата": "01.09.2025", "Температура": 20},
        {"Дата": "02.09.2025", "Температура": 23},
        {"Дата": "03.09.2025", "Температура": 15},
        {"Дата": "04.09.2025", "Температура": 18}
    ]
}

dict_data = {entry["Дата"]: entry["Температура"] for entry in json_data["Температуры за месяц"]}

print(dict_data)