# Вложенные структуры
# Создайте JSON-объект, представляющий каталог товаров с вложенной структурой (категория → подкатегория → товары). 
# Реализуйте поиск товара по названию.

import json

# Каталог товаров
catalog = {
    "Электроника": {
        "Смартфоны": [
            {"Наименование": "iPhone 16 Pro", "Цена": 100000},
            {"Наименование": "Samsung Galaxy S25", "Цена": 90000}
        ],
        "Ноутбуки": [
            {"Наименование": "MacBook Air", "Цена": 120000},
            {"Наименование": "Dell XPS 13", "Цена": 62000}
        ]
    },
    "Одежда": {
        "Мужская": [
            {"Наименование": "Футболка", "Размер": "L", "Цена": 1000},
            {"Наименование": "Футболка", "Размер": "XL", "Цена": 1000},
            {"Наименование": "Джинсы", "Цена": 2000}
        ],
        "Женская": [
            {"Наименование": "Футболка", "Размер": "XS", "Цена": 1000},
            {"Наименование": "Футболка", "Размер": "M", "Цена": 1000},
            {"Наименование": "Платье", "Цена": 3000},
            {"Наименование": "Юбка", "Цена": 2500}
        ]
    }
}

def find_product_by_name(catalog, product_name):
    results = []
    for category, subcategories in catalog.items():
        for subcategory, products in subcategories.items():
            for product in products:
                if product_name.lower() in product["Наименование"].lower():
                    results.append({
                        "Категория": category,
                        "Подкатегория": subcategory,
                        "Наименование": product["Наименование"],
                        "Цена": product["Цена"]
                    })
    return results



if __name__ == "__main__":
    name = input("Введите название товара для поиска: ")
    found = find_product_by_name(catalog, name)

    if found:
        print(found)
    else:
        print("Товар не найден")